# Subsetting

Review core methods to select data from a `pandas.Dataframe`

## read in CSV

To read in a csv file into our Python workspace as a `pandas.Dataframe`, we use the `pandas.read_csv` function:

In [2]:
import pandas as pd

# Read in file, the argument is the file path as a string

df = pd.read_csv('data/wetlands_seasonal_bird_diversity.csv')

# now printing first 5 rows

df.head()

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
1,2011,48.0,44.0,NaN,58.0,52.0,NaN,78.0,74.0,NaN,67.0,70.0,NaN
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

Birds were surveyed in four wetlands:

- Carpinteria Salt Marsh (CSM)
- Mugu Lagoon (MUL)
- San Diego Wetland (SDW)
- Tijuana Estuary (TJE)

values from second column to the last column = number if different bird species recorded across the survey sites in each wetland during spring, winter, and fall, for a given year

year column = year on which data was collected.

In [4]:
# Print the dataframe columns names

df.columns

Index(['year', 'CSM_winter', 'CSM_spring', 'CSM_fall', 'MUL_winter',
       'MUL_spring', 'MUL_fall', 'SDW_winter', 'SDW_spring', 'SDW_fall',
       'TJE_winter', 'TJE_spring', 'TJE_fall'],
      dtype='object')

In [6]:
# List dtypes of each column

df.dtypes

year            int64
CSM_winter    float64
CSM_spring    float64
CSM_fall      float64
MUL_winter    float64
MUL_spring    float64
MUL_fall      float64
SDW_winter    float64
SDW_spring    float64
SDW_fall      float64
TJE_winter    float64
TJE_spring    float64
TJE_fall      float64
dtype: object

In [7]:
# Print the dataframe's shape

df.shape

(14, 13)

## Selecting a single column
Select a single column by column name

general syntax:
```python
df['column name']
```

This is an example of label based subsettings, which means we want to select data from our df using the names of the columns, not their positions.

### Example:

Select number of bird species observed at Mugu lagoon in spring.

In [9]:
# Select a single column using square brackets

mul_spring = df['MUL_spring']
mul_spring

0      NaN
1     52.0
2     58.0
3     58.0
4     52.0
5     50.0
6     48.0
7     54.0
8     54.0
9     52.0
10     NaN
11    55.0
12    55.0
13    59.0
Name: MUL_spring, dtype: float64

In [17]:
# Confirm the type of output:
print(type(mul_spring))

<class 'pandas.core.series.Series'>

We can think of a pandas dataframe as a dictionary of it's columns. 
Then, we can access a single column using the column name as the key, just like we would in a dictionary.
`df['column name']`

We can also do label-based subsetting of a single column using attribute syntax:
```python
df.column_name
```

In [15]:
df.MUL_spring

0      NaN
1     52.0
2     58.0
3     58.0
4     52.0
5     50.0
6     48.0
7     54.0
8     54.0
9     52.0
10     NaN
11    55.0
12    55.0
13    59.0
Name: MUL_spring, dtype: float64

We should favor `df['column_name']` instead!
This one avoids conflicts, imagine if our column name had a space in it. 
Avoids conflicts with `pd.Dataframes` methods and attributes. If `df` has a column named 'count', Python doesn't know if we are referencing the column df.count or asking to count something using df.count. 

- `df['column_name']` can take any column name.

## Selecting multiple columns:

We can select multiple by using a list of column names in the square brackets. 

```python
df[['col1', 'col2', 'col3']]
```

Double square brackets when making a list!

### Example:

In [19]:
# Select columns with names 'TJE_winter' and 'TJE_fall'

tje_wf = df[['TJE_winter', 'TJE_fall']]
tje_wf

    TJE_winter  TJE_fall
0          NaN      81.0
1         67.0       NaN
2         70.0      69.0
3         69.0      64.0
4         60.0      62.0
5         73.0      64.0
6         76.0      58.0
7         72.0      57.0
8         66.0      55.0
9         63.0      50.0
10        54.0      54.0
11        53.0      51.0
12        60.0      60.0
13        60.0      38.0

In [21]:
# this creates a pandas dataframe!

print(type(tje_wf))

<class 'pandas.core.frame.DataFrame'>

### using a slice

To select a slice of the columns, we will use a special case of the `loc` selection. General syntax:
```python
df.loc[ : , 'column_start':'column_end']
```
'column_start' and 'column_end' are the starting and ending points of the column slice we want to subset from the dataframe.

Notice:

- The first value passed to the `loc` is used for selecting rows; using a colon as the row selection parameter means 'select all rows'

- the slice of the resulting data frame includes both endpoints of the slice.

In [23]:
# Select columns between 'CSM_winter' and 'MUL_fall'
csm_mul = df.loc[:, 'CSM_winter':'MUL_fall']
csm_mul

    CSM_winter  CSM_spring  CSM_fall  MUL_winter  MUL_spring  MUL_fall
0         39.0        40.0      50.0        45.0         NaN      61.0
1         48.0        44.0       NaN        58.0        52.0       NaN
2         51.0        43.0      49.0        57.0        58.0      53.0
3         42.0        46.0      38.0        60.0        58.0      62.0
4         38.0        43.0      45.0        49.0        52.0      57.0
5         44.0        42.0      45.0        58.0        50.0      51.0
6         41.0        36.0      47.0        63.0        48.0      58.0
7         46.0        41.0      43.0        57.0        54.0      53.0
8         48.0        48.0      44.0        56.0        54.0      57.0
9         39.0        39.0      40.0        57.0        52.0      53.0
10        46.0         NaN      47.0        56.0         NaN      66.0
11        47.0        44.0      53.0        54.0        55.0      60.0
12        40.0        46.0      49.0        60.0        55.0      65.0
13        56.0        43.0      36.0        72.0        59.0      53.0

## Selecting rows...

### ...using a condition!
To select rows with a particular condition, the syntax is:
```python
df[condition_on_rows]
```

The `contition_on_rows` can be many things, let's see some examples:

### Example

We are interested in data after 2020. So, select all rows after 2020.

In [25]:
# Select rows with year > 2020.

post_2020 = df[df['year']>2020]
post_2020

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
12,2022,40.0,46.0,49.0,60.0,55.0,65.0,57.0,60.0,57.0,60.0,61.0,60.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

condition of our rows = `df['year'] > 2020`

this is a `pandas.Series` with boolean values (`True` or `False`) indicating which rows satisfy the condition year >2020.

In [27]:
# Check type of df['year'] > 2020

print(type(df['year'] > 2020))
df['year'] > 2020

<class 'pandas.core.series.Series'>

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12     True
13     True
Name: year, dtype: bool

When we pass a series of boolean values to the brackets, we only get values that correspond to a `True` value. 

## Check-in

Get the subset of the dataframe on which the San Diego wetland has at least 75 species recorded during spring.

In [29]:
print(df['SDW_spring'])

0     75.0
1     74.0
2     72.0
3     70.0
4     78.0
5     61.0
6     62.0
7     45.0
8     49.0
9     55.0
10     NaN
11    58.0
12    60.0
13    63.0
Name: SDW_spring, dtype: float64

In [32]:
sdw_spring_over75 = df[df['SDW_spring'] >= 75]
sdw_spring_over75

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0